Reports/Website/JuliaProcessor.org
* Julia Set Renderer
The Julia Set Renderer is a combination of compiler (written in Haskell) and a
custom VLIW processor/supporting framework running on an FPGA. Julia sets are fractal
shapes which are generated by iterating a point's coordinate in a rational
polynomial for every point in the complex plane. Under that iteration, the value
will either diverge to infinity eventually in which case it is not considered in
the set, or have a magnitude bounded by a some constant in which case it is
considered in the set.

This project gives the user a terminal in which to type a formula (for example
$z^2+c$) and draws the Julia set on a VGA screen. The user can use a mouse to
pan/zoom around the drawn set.

* Architecture
I started with my implementation of a solver for [[https://people.ece.cornell.edu/land/courses/ece5760/LABS/s2017/lab4_mandelbrot.html][Lab 4 - Mandelbrot Set]]. My
implementation used 27-bit, floating point arithmetic to draw regions of the
Mandelbrot set by mapping each pixel to a coordinate in the complex plane and
determining whether the iterated equation $Z_{n+1} = Z_n^2 + C$, where $Z_0=0 +
0i$ and $C$ is the coordinate corresponding to the pixel in question,
diverges. The color of the pixel is determined by how many iterations it took
for $Z$ to have magnitude greater than $2$ (after which the iterated equation
will provably diverge), capped at 1000 iterations.

For that project, implemented on the DE1-SoC development board, I used the HPS
(an ARM processor connected to the FPGA fabric via an AXI bus) to handle the UI
components including the mouse updates, and the FPGA to fill the VGA framebuffer
with colors based on how long it took the point to escape. The HPS updates the
parameters in the FPGA used to map the pixels on the screen to complex
coordinates based on the user inptus to enable the interactivity.

In the Mandelbrot set project my solver iterating the equation for $Z$ was
static and hand optimized for the given equation. In this project I replaced
that solver with a VLIW CPU designed to support a limited set of floating point
operations that could be used to iterate arbitrary equations (see [[VLIW
Processor]]). I also wrote a compiler which produces instructions to be run on the
VLIW processor (see [[Compiler]]).

I will first describe the architecture of the FPGA-side framework that sets up
the VLIW processor to solve a particular pixel, then the HPS-side UI components,
and finally the heart of this project - the VLIW processor and its compiler.

** Framework (FPGA)
*** Pixel Solver
The pixel solver, a shim around the the VLIW processor, provides an interface
for controlling the VLIW processor. Interfacing with the pixel solver consists
of waiting for the pixel solver to set a flag high indicating that it is ready
to receive a new input. On the same cycle that the inputs are ready a ~start~
signal is strobed which sets off the computation. The solver takes as inputs a
signal ~C_B~ which is the imaginary component of the value to be
iterated. Additionally, it accepts ~C_A_reference~ (floating point), ~C_A_step~
(floating point), and ~C_A_column~ (10-bit unsigned number), which specify the
real component of the point's location by the expression $C\_A\_reference +
C\_A\_step * C\_A\_column$. Passing those values to the solver instead of
computing them outside the solver is an optimization which allows using the
solver's instantiated adder/multiplier instead of instantiating new ones as
resources on the board are in high demand. When the solver is done, it sets it's
output ~num_iterations~ to the number of iterations it took to escape the
threshold and strobes the outut ~done~ (effectively sending an interrupt). A new
value may now be loaded.

*** Row Solver
The row solver instantiates a single pixel solver, but provides an additional
abstraction. The row solver accepts the imaginary coordinate of the point to be
operated, the first real value, and the real step size (those are passed
directly directly to the pixel solver in addition to the column number which the
row solver generates). The row solver has a similar request/grant interface for
inputs. The row solver generates a pixel's value, column index, and row index
strobing another output each time the outputs are valid.

The row solver supplies the nested pixel solver with the necessary inputs,
starting at column 0. When the pixel solver strobes that an output is ready that
is combinationally passed to the row solver's outputs (additional outputs of the
row solver are set when the solver receives its ~grant~ and are constant for the
duration of the row). Each time the pixel solver completes the row solver
increments the column count and restarts the pixel solver on the next cycle
unless the end of the row has been reached in which case the row solver enters
the reset state, awaiting another ~grant~.

