Reports/Website/JuliaProcessor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-16 Tue 05:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Istvan P. Burbank" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org826fc22">1. Julia Set Renderer</a></li>
<li><a href="#org6070a6d">2. Architecture</a>
<ul>
<li><a href="#orga116878">2.1. Framework (FPGA)</a>
<ul>
<li><a href="#orgeb26fa4">2.1.1. Pixel Solver</a></li>
<li><a href="#org03c288c">2.1.2. Row Solver</a></li>
<li><a href="#org380b0dc">2.1.3. Frame Solver</a></li>
<li><a href="#orgf315afa">2.1.4. Top Level</a></li>
<li><a href="#org0d2899f">2.1.5. QSys</a></li>
</ul>
</li>
<li><a href="#org3b66322">2.2. User Control (HPS)</a></li>
</ul>
</li>
<li><a href="#orge63eca9">3. Program/hardware design:</a>
<ul>
<li><a href="#org64fbe3c">3.1. Compiler</a>
<ul>
<li><a href="#orgc78118a">3.1.1. Parser</a></li>
<li><a href="#org1196588">3.1.2. IR</a></li>
<li><a href="#org6bc49f6">3.1.3. Assembler</a></li>
</ul>
</li>
<li><a href="#org1244ae1">3.2. VLIW Processor</a></li>
<li><a href="#org0077a5b">3.3. Row Solver</a></li>
<li><a href="#org75721c1">3.4. Frame Solver</a></li>
</ul>
</li>
<li><a href="#orgf298705">4. Results of the design:</a></li>
<li><a href="#orgd9bfdf4">5. Conclusions:</a></li>
<li><a href="#orgbfece45">6. Appndix A</a></li>
<li><a href="#org90b7906">7. Appendix with commented Verilog and/or program listings. When posting code, you must comply with all Altera IP considerations.</a></li>
<li><a href="#org1fcd7f1">8. Appendix with schematics if you build hardware external to the DE2 board (you can download free software from expresspcb.com to draw schematics).</a></li>
<li><a href="#org19429b8">9. Appendix with a list of the specific tasks in the project carried out by each team member.</a></li>
<li><a href="#orgfb12364">10. References you used:</a></li>
</ul>
</div>
</div>
<div id="outline-container-org826fc22" class="outline-2">
<h2 id="org826fc22"><span class="section-number-2">1</span> Julia Set Renderer</h2>
<div class="outline-text-2" id="text-1">
<p>
The Julia Set Renderer is a combination of compiler (written in Haskell) and a
custom VLIW processor/supporting framework running on an FPGA. Julia sets are fractal
shapes which are generated by iterating a point's coordinate in a rational
polynomial for every point in the complex plane. Under that iteration, the value
will either diverge to infinity eventually in which case it is not considered in
the set, or have a magnitude bounded by a some constant in which case it is
considered in the set.
</p>

<p>
This project gives the user a terminal in which to type a formula (for example
\(z^2+c\)) and draws the Julia set on a VGA screen. The user can use a mouse to
pan/zoom around the drawn set.
</p>
</div>
</div>

<div id="outline-container-org6070a6d" class="outline-2">
<h2 id="org6070a6d"><span class="section-number-2">2</span> Architecture</h2>
<div class="outline-text-2" id="text-2">
<p>
I started with my implementation of a solver for <a href="https://people.ece.cornell.edu/land/courses/ece5760/LABS/s2017/lab4_mandelbrot.html">Lab 4 - Mandelbrot Set</a>. My
implementation used 27-bit, floating point arithmetic to draw regions of the
Mandelbrot set by mapping each pixel to a coordinate in the complex plane and
determining whether the iterated equation \(Z_{n+1} = Z_n^2 + C\), where \(Z_0=0 +
0i\) and \(C\) is the coordinate corresponding to the pixel in question,
diverges. The color of the pixel is determined by how many iterations it took
for \(Z\) to have magnitude greater than \(2\) (after which the iterated equation
will provably diverge), capped at 1000 iterations.
</p>

<p>
For that project, implemented on the DE1-SoC development board, I used the HPS
(an ARM processor connected to the FPGA fabric via an AXI bus) to handle the UI
components including the mouse updates, and the FPGA to fill the VGA framebuffer
with colors based on how long it took the point to escape. The HPS updates the
parameters in the FPGA used to map the pixels on the screen to complex
coordinates based on the user inptus to enable the interactivity.
</p>

<p>
In the Mandelbrot set project my solver iterating the equation for \(Z\) was
static and hand optimized for the given equation. In this project I replaced
that solver with a VLIW CPU designed to support a limited set of floating point
operations that could be used to iterate arbitrary equations (see <a href="#org1244ae1">3.2</a>). I also wrote a compiler which produces instructions to be run on the
VLIW processor (see <a href="#org64fbe3c">3.1</a>).
</p>

<p>
I will first describe the architecture of the FPGA-side framework that sets up
the VLIW processor to solve a particular pixel, then the HPS-side UI components,
and finally the heart of this project - the VLIW processor and its compiler.
</p>
</div>

<div id="outline-container-orga116878" class="outline-3">
<h3 id="orga116878"><span class="section-number-3">2.1</span> Framework (FPGA)</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-orgeb26fa4" class="outline-4">
<h4 id="orgeb26fa4"><span class="section-number-4">2.1.1</span> Pixel Solver</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The pixel solver, a shim around the the VLIW processor, provides an interface
for controlling the VLIW processor. Interfacing with the pixel solver consists
of waiting for the pixel solver to set a flag high indicating that it is ready
to receive a new input. On the same cycle that the inputs are ready a <code>start</code>
signal is strobed which sets off the computation. The solver takes as inputs a
signal <code>C_B</code> which is the imaginary component of the value to be
iterated. Additionally, it accepts <code>C_A_reference</code> (floating point), <code>C_A_step</code>
(floating point), and <code>C_A_column</code> (10-bit unsigned number), which specify the
real component of the point's location by the expression \(C\_A\_reference +
C\_A\_step * C\_A\_column\). Passing those values to the solver instead of
computing them outside the solver is an optimization which allows using the
solver's instantiated adder/multiplier instead of instantiating new ones as
resources on the board are in high demand. When the solver is done, it sets it's
output <code>num_iterations</code> to the number of iterations it took to escape the
threshold and strobes the outut <code>done</code> (effectively sending an interrupt). A new
value may now be loaded.
</p>
</div>
</div>

<div id="outline-container-org03c288c" class="outline-4">
<h4 id="org03c288c"><span class="section-number-4">2.1.2</span> Row Solver</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The row solver instantiates a single pixel solver, but provides an additional
abstraction. The row solver accepts the imaginary coordinate of the point to be
operated, the first real value, and the real step size (those are passed
directly directly to the pixel solver in addition to the column number which the
row solver generates). The row solver has a similar request/grant interface for
inputs. The row solver generates a pixel's value, column index, and row index
strobing another output each time the outputs are valid.
</p>

<p>
The row solver supplies the nested pixel solver with the necessary inputs,
starting at column 0. When the pixel solver strobes that an output is ready that
is combinationally passed to the row solver's outputs (additional outputs of the
row solver are set when the solver receives its <code>grant</code> and are constant for the
duration of the row). Each time the pixel solver completes the row solver
increments the column count and restarts the pixel solver on the next cycle
unless the end of the row has been reached in which case the row solver enters
the reset state, awaiting another <code>grant</code>.
</p>
</div>
</div>
