Reports/Website/JuliaProcessor.org
*** Frame Solver
The frame solver accepts the coordinates of the top left corner of the screen
and the step sizes for the real and imaginary axes. The frame solver
instantiates more than 45 row solvers and coordinates the inputs and outputs
to/from each. At most one row solver is given a ~grant~ in a particular cycle
(so it takes at least 45 cycles to get the row solvers all computing). On any
cycle when at least one row solver's ~request~ flag is set high the lowest
indexed row solver whose ~request~ is high receives a ~grant~ and gets assigned
an imaginary coordinate corresponding to the row it should start computing. The
imaginary coordinate is incremented by the imaginary step size using an
adder. If no row solvers are have their ~request~ flag set then no action is
taken. If the row index exceeds the frame size then it is reset to 0 and the
running count of the imaginary coordinate is reset to the initial value (that of
the top left corner).

The output of each row solver is fed into a corresponding true dual-ported
FIFO. Each time the row solver strobes its output signal the coordinates of the
most recently generated pixel and the pixel's value are concatenated and
inserted into a FIFO.

On a separate clock domain, the outputs of the FIFOs are arbitrated and used as
the outputs of the frame solver. On each clock cycle on the ~output_clk~
domain a pixel's coordinates and value may be output; if one is available on
that cycle then a strobe signal is set high. FIFOs are emptied with those having
lowest index having highest priority. While that is not fair, it doesn't impact
the draw time of the solver since the high-indexed solvers will simply be
blocked when framebuffer bandwidth is the limiting factor and since solvers are
not pre-assigned rows a subsequent change in the cause of the bottleneck would
not disproportionately leave some solvers "out of work".

*** Top Level
The top level module instantiates a single frame solver and interfaces it with
the HPS PIO signals and the VGA framebuffer. The VGA framebuffer is a
dual-ported SRAM with one port dedicated to the VGA subsystem and the second
exported from QSYS into Verilog. The output interface of the Frame Solver
conveniently wires combinationally into the input interface of the SRAM; each
time the frame solver's strobe indicating an output is available is wired to the
SRAM's write enable and the frame solver's pixel coordinates combinationally
determine the address to which the frame solver's iteration count output should
be written. This is by design to minimize logic which can't be unit tested in
ModelSim (the top level module is the only module not tested in ModelSim, as is
discussed later). The SRAM's value is an 8-bit color which is determined by the
bottom eight bits of the number of iterations that point took to escape.

The top level module also keeps track of the number of cycles it takes to
compute each frame which is passed to the HPS to display in milliseconds on the display.

*** QSys
TODO

** User Control (HPS)
The HPS, running Linux, is responsible for updating the PIO registers with the
current frame's top-left-corner position and step size. The user's mouse
movements are scaled based on the current zoom and used to update the position,
while the left/right mouse buttons increased and decreased the zoom by updating
the step size and the top-left-corner position accordingly to keep the image
centered during a zoom (otherwise you would be zooming into the top left
corner).

The HPS loads the a program generated by the compiler into the program memory
when the HPS program is launched.

The HPS also displays the current coordinates and the frame generation time on
the display in the text buffer.

* Program/hardware design:
    # program details. What parts were tricky to write?
    # hardware details. Could someone else build this based on what you have written?
    # Be sure to specifically reference any design or code you used from someone else.
    # Things you tried which did not work
** Compiler

$z*z+1i2$

*** Parser
data Exp = Num Int
         | Cpx Exp Exp -- complex
         | Var String
         | Add Exp Exp
         | Sub Exp Exp
         | Mul Exp Exp
         | Div Exp Exp
         | Pow Exp Exp
         | Pos Exp
         | Neg Exp
           deriving (Show)

#+BEGIN_SRC haskell
Right (Add (Mul (Var "z") (Var "z")) (Cpx (Num 1) (Num 2)))
#+END_SRC

