Reports/Website/JuliaProcessor.html

<div id="outline-container-org380b0dc" class="outline-4">
<h4 id="org380b0dc"><span class="section-number-4">2.1.3</span> Frame Solver</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
The frame solver accepts the coordinates of the top left corner of the screen
and the step sizes for the real and imaginary axes. The frame solver
instantiates more than 45 row solvers and coordinates the inputs and outputs
to/from each. At most one row solver is given a <code>grant</code> in a particular cycle
(so it takes at least 45 cycles to get the row solvers all computing). On any
cycle when at least one row solver's <code>request</code> flag is set high the lowest
indexed row solver whose <code>request</code> is high receives a <code>grant</code> and gets assigned
an imaginary coordinate corresponding to the row it should start computing. The
imaginary coordinate is incremented by the imaginary step size using an
adder. If no row solvers are have their <code>request</code> flag set then no action is
taken. If the row index exceeds the frame size then it is reset to 0 and the
running count of the imaginary coordinate is reset to the initial value (that of
the top left corner).
</p>

<p>
The output of each row solver is fed into a corresponding true dual-ported
FIFO. Each time the row solver strobes its output signal the coordinates of the
most recently generated pixel and the pixel's value are concatenated and
inserted into a FIFO.
</p>

<p>
On a separate clock domain, the outputs of the FIFOs are arbitrated and used as
the outputs of the frame solver. On each clock cycle on the <code>output_clk</code>
domain a pixel's coordinates and value may be output; if one is available on
that cycle then a strobe signal is set high. FIFOs are emptied with those having
lowest index having highest priority. While that is not fair, it doesn't impact
the draw time of the solver since the high-indexed solvers will simply be
blocked when framebuffer bandwidth is the limiting factor and since solvers are
not pre-assigned rows a subsequent change in the cause of the bottleneck would
not disproportionately leave some solvers "out of work".
</p>
</div>
</div>

<div id="outline-container-orgf315afa" class="outline-4">
<h4 id="orgf315afa"><span class="section-number-4">2.1.4</span> Top Level</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
The top level module instantiates a single frame solver and interfaces it with
the HPS PIO signals and the VGA framebuffer. The VGA framebuffer is a
dual-ported SRAM with one port dedicated to the VGA subsystem and the second
exported from QSYS into Verilog. The output interface of the Frame Solver
conveniently wires combinationally into the input interface of the SRAM; each
time the frame solver's strobe indicating an output is available is wired to the
SRAM's write enable and the frame solver's pixel coordinates combinationally
determine the address to which the frame solver's iteration count output should
be written. This is by design to minimize logic which can't be unit tested in
ModelSim (the top level module is the only module not tested in ModelSim, as is
discussed later). The SRAM's value is an 8-bit color which is determined by the
bottom eight bits of the number of iterations that point took to escape.
</p>

<p>
The top level module also keeps track of the number of cycles it takes to
compute each frame which is passed to the HPS to display in milliseconds on the display.
</p>
</div>
</div>

<div id="outline-container-org0d2899f" class="outline-4">
<h4 id="org0d2899f"><span class="section-number-4">2.1.5</span> QSys</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
TODO
</p>
</div>
</div>
</div>

<div id="outline-container-org3b66322" class="outline-3">
<h3 id="org3b66322"><span class="section-number-3">2.2</span> User Control (HPS)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The HPS, running Linux, is responsible for updating the PIO registers with the
current frame's top-left-corner position and step size. The user's mouse
movements are scaled based on the current zoom and used to update the position,
while the left/right mouse buttons increased and decreased the zoom by updating
the step size and the top-left-corner position accordingly to keep the image
centered during a zoom (otherwise you would be zooming into the top left
corner).
</p>

<p>
The HPS loads the a program generated by the compiler into the program memory
when the HPS program is launched.
</p>

<p>
The HPS also displays the current coordinates and the frame generation time on
the display in the text buffer.
</p>
</div>
</div>
</div>

<div id="outline-container-orge63eca9" class="outline-2">
<h2 id="orge63eca9"><span class="section-number-2">3</span> Program/hardware design:</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org64fbe3c" class="outline-3">
<h3 id="org64fbe3c"><span class="section-number-3">3.1</span> Compiler</h3>
<div class="outline-text-3" id="text-3-1">
<p>
\(z*z+1i2\)
</p>
</div>

<div id="outline-container-orgc78118a" class="outline-4">
<h4 id="orgc78118a"><span class="section-number-4">3.1.1</span> Parser</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
data Exp = Num Int
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Cpx Exp Exp &#x2013; complex</td>
</tr>

<tr>
<td class="org-left">Var String</td>
</tr>

<tr>
<td class="org-left">Add Exp Exp</td>
</tr>

<tr>
<td class="org-left">Sub Exp Exp</td>
</tr>

<tr>
<td class="org-left">Mul Exp Exp</td>
</tr>

<tr>
<td class="org-left">Div Exp Exp</td>
</tr>

<tr>
<td class="org-left">Pow Exp Exp</td>
</tr>

<tr>
<td class="org-left">Pos Exp</td>
</tr>

<tr>
<td class="org-left">Neg Exp</td>
</tr>
</tbody>
</table>
<p>
deriving (Show)
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ae234; font-weight: bold;">Right</span> <span style="color: #8c8c8c;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> <span style="color: #93a8c6;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Var</span> <span style="color: #ad7fa8; font-style: italic;">"z"</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Var</span> <span style="color: #ad7fa8; font-style: italic;">"z"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span><span style="color: #8ae234; font-weight: bold;">Cpx</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Num</span> 1<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Num</span> 2<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
