Reports/Website/JuliaProcessor.html

<div id="outline-container-org1196588" class="outline-4">
<h4 id="org1196588"><span class="section-number-4">3.1.2</span> IR</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">Instruction</span> <span style="color: #ff6347;">=</span>
  <span style="color: #888a85;">--     </span><span style="color: #888a85;">SRC1     SRC2     DEST</span>
    <span style="color: #8ae234; font-weight: bold;">Add</span>  <span style="color: #8ae234; font-weight: bold;">Register</span> <span style="color: #8ae234; font-weight: bold;">Register</span> <span style="color: #8ae234; font-weight: bold;">Register</span>
  <span style="color: #ff6347;">|</span> <span style="color: #8ae234; font-weight: bold;">Mul</span>  <span style="color: #8ae234; font-weight: bold;">Register</span> <span style="color: #8ae234; font-weight: bold;">Register</span> <span style="color: #8ae234; font-weight: bold;">Register</span>
  <span style="color: #888a85;">--     </span><span style="color: #888a85;">SRC      DEST</span>
  <span style="color: #ff6347;">|</span> <span style="color: #8ae234; font-weight: bold;">Neg</span>  <span style="color: #8ae234; font-weight: bold;">Register</span> <span style="color: #8ae234; font-weight: bold;">Register</span>
  <span style="color: #888a85;">--     </span><span style="color: #888a85;">Val      DEST</span>
  <span style="color: #ff6347;">|</span> <span style="color: #8ae234; font-weight: bold;">Load</span> <span style="color: #8ae234; font-weight: bold;">Int</span>      <span style="color: #8ae234; font-weight: bold;">Register</span>
  <span style="color: #888a85;">--     </span><span style="color: #888a85;">DEST</span>
  <span style="color: #ff6347;">|</span> <span style="color: #8ae234; font-weight: bold;">Var</span>  <span style="color: #8ae234; font-weight: bold;">Register</span>
                 <span style="color: #729fcf; font-weight: bold;">deriving</span> <span style="color: #8c8c8c;">(</span><span style="color: #8ae234; font-weight: bold;">Show</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">type</span> <span style="color: #8ae234; font-weight: bold;">Complex</span> <span style="color: #ff6347;">=</span> <span style="color: #8c8c8c;">(</span><span style="color: #8ae234; font-weight: bold;">Register</span>, <span style="color: #8ae234; font-weight: bold;">Register</span><span style="color: #8c8c8c;">)</span>
<span style="color: #edd400; font-weight: bold;">preschedule</span> <span style="color: #ff6347;">::</span> <span style="color: #8ae234; font-weight: bold;">JuliaParser.Exp</span> <span style="color: #ff6347;">-&gt;</span> <span style="color: #8ae234; font-weight: bold;">State</span> <span style="color: #8ae234; font-weight: bold;">Int</span> <span style="color: #8c8c8c;">(</span><span style="color: #93a8c6;">[</span><span style="color: #b0b1a3;">[</span><span style="color: #8ae234; font-weight: bold;">Instruction</span><span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">]</span>, <span style="color: #8ae234; font-weight: bold;">Complex</span><span style="color: #8c8c8c;">)</span>

<span style="color: #729fcf; font-weight: bold;">data</span> <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #8c8c8c;">{</span> load <span style="color: #ff6347;">::</span> <span style="color: #8ae234; font-weight: bold;">Maybe</span> <span style="color: #8ae234; font-weight: bold;">Instruction</span>
                   , add  <span style="color: #ff6347;">::</span> <span style="color: #8ae234; font-weight: bold;">Maybe</span> <span style="color: #8ae234; font-weight: bold;">Instruction</span>
                   , mul  <span style="color: #ff6347;">::</span> <span style="color: #8ae234; font-weight: bold;">Maybe</span> <span style="color: #8ae234; font-weight: bold;">Instruction</span>
                   , neg  <span style="color: #ff6347;">::</span> <span style="color: #8ae234; font-weight: bold;">Maybe</span> <span style="color: #8ae234; font-weight: bold;">Instruction</span>
                   <span style="color: #8c8c8c;">}</span> <span style="color: #729fcf; font-weight: bold;">deriving</span> <span style="color: #8c8c8c;">(</span><span style="color: #8ae234; font-weight: bold;">Show</span><span style="color: #8c8c8c;">)</span>

<span style="color: #edd400; font-weight: bold;">flattenSchedule</span> <span style="color: #ff6347;">::</span> <span style="color: #8c8c8c;">[</span><span style="color: #93a8c6;">[</span><span style="color: #8ae234; font-weight: bold;">Instruction</span><span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">]</span> <span style="color: #ff6347;">-&gt;</span> <span style="color: #8c8c8c;">[</span><span style="color: #8ae234; font-weight: bold;">Cycle</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8c8c8c;">[</span>
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 4 5 2<span style="color: #b0b1a3;">)</span>,       mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> 0 0 4<span style="color: #b0b1a3;">)</span>,   neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> 1 1 5<span style="color: #b0b1a3;">)</span>,   neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 4 522 0<span style="color: #b0b1a3;">)</span>,     mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 4 523 1<span style="color: #b0b1a3;">)</span>,     mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Load</span> 0 4<span style="color: #b0b1a3;">)</span>,  add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 525 20 523<span style="color: #b0b1a3;">)</span>,  mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 524 19 522<span style="color: #b0b1a3;">)</span>,  mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Load</span> 2 20<span style="color: #b0b1a3;">)</span>, add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Load</span> 1 19<span style="color: #b0b1a3;">)</span>, add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 785 784 525<span style="color: #b0b1a3;">)</span>, mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> 1 0 785<span style="color: #b0b1a3;">)</span>, neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> 0 1 784<span style="color: #b0b1a3;">)</span>, neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Add</span> 274 782 524<span style="color: #b0b1a3;">)</span>, mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,            neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Neg</span> 783 274<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> 1 1 783<span style="color: #b0b1a3;">)</span>, neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>,
  <span style="color: #8ae234; font-weight: bold;">Cycle</span> <span style="color: #93a8c6;">{</span>load <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,          add <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span>,                mul <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Just</span> <span style="color: #b0b1a3;">(</span><span style="color: #8ae234; font-weight: bold;">Mul</span> 0 0 782<span style="color: #b0b1a3;">)</span>, neg <span style="color: #ff6347;">=</span> <span style="color: #8ae234; font-weight: bold;">Nothing</span><span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">]</span>
</pre>
</div>
</div>
</div>
