Reports/Website/JuliaProcessor.org
*** Assembler
#+BEGIN_SRC haskell
encodeLoad :: Maybe IR.Instruction -> BV.BV
assemble :: [IR.Cycle] -> [Word128]
#+END_SRC

Reversed and assembled:
#+BEGIN_SRC
[
  1073742606,
  1074792207,
  8534579836514498005434368,
  2924556919630725120,
  1073743632,
  1074791185,
  4075231024617881600,
  1329228005872192911768272894028677120,
  1329228015785384632608232126619320320,
  3485829014013083648,
  3488083014997508096,
  0,
  1329227995823601499131475193870942208,
  2316000299778572288,
  2315998098607833088,
  0,
  1074791429,
  1073741828,
  2314861207879680000,
  0,
  0
]
#+END_SRC

** VLIW Processor
The VLIW processor, as indicated in [[Compiler][Compiler]], has Load, Neg, Add,
and Mul pipes. It additionally has a register file and all the logic required to marshal data to and from registers/pipes as needed.

The processor has a floating point register file where the first three registers
(indexes 0-2) are special-purpose and the remainder are general
purpose. Registers 0 and 1 are designated to hold the real and imaginary
components of $Z$ respectively. Thus, the compiled program can count on the
result of the previous iteration being there and is responsible for storing the
result of its computation there as well. In the next section I describe how
$Z_0$ is loaded into those registers. Register 2 is special-purposed to throw an
interrupt when a value larger than ~max_magnitude~ is written to it. The last
thing the compiled programs do is calculate the squared magnitude of $Z_n$ and
write it to register 2; if the magnitude has escaped the threshold then the
processor sets its ~done~ flag high (the VLIW processor takes no further action,
but the Row Solver's response is described next).

** Row Solver
The Row Solver has two (TODO) states: a ~reset/init~ state and ~compute~ state. An
interesting note is that the pixel solver is restarted within the same cycle as
it finishes if the row solver hasn't reached the end of the row yet, saving
hundreds of cycles per row. Otherwise, this is a pretty trivial implementation.

Note that the signals that start with ~solver_~ reference the pixel
solver's signals, not the row solver's. 

#+BEGIN_SRC verilog
parameter state_reset=0, state_compute=1;
always @(posedge solver_clk) begin
   if(reset || state == state_reset) begin
      state <= state_reset;
      start_request <= 1;
      if (start_grant) begin
         state <= state_compute;
         start_request <= 0;
         output_row_idx <= row_y_idx;
         // start the simulation of the first element of the row
         solver_C_A_reference <= row_x_reference;
         solver_C_A_step      <= row_x_step;
         column_idx           <= 0;
         solver_C_B           <= row_y;
         solver_start         <= 1;
      end
   end
   else if (state == state_compute) begin
      if (solver_start) solver_start <= 0; // only needs to be hi once
      if (solver_done) begin
         // receive results
         // start on new results
         if (column_idx == 639) begin // just finished last column
            state <= state_reset;
         end
         else begin
            column_idx   <= column_idx + 1;
            solver_start <= 1;
         end
      end
   end
end
#+END_SRC

** Frame Solver
The frame solver consists of two main components: the arbiters getting data
to/from the row sovlers and a generate loop which instantiates the row
solvers/their FIFOs.

A minimal state machine generates a new imaginary number corresponding to a row
that needs to be computed every time a row solver receives a grant:

#+BEGIN_SRC verilog
always @(posedge solver_clk) begin
   frame_done_stb <= 0; // default value
   if (reset) begin
      row_next_y_idx <= 0;
      row_next_y_value <= y_0;
   end
   else if (row_next_y_idx == 479) begin
      // frame is done
      row_next_y_idx <= 0;
      frame_done_stb <= 1;
      // reset things
      row_next_y_idx <= 0;
      row_next_y_value <= y_0;
   end
   else if (row_solver_start_grant > 0) begin
      row_next_y_idx <= row_next_y_idx + 1;
      row_next_y_value <= row_next_y_value_adder_out;
   end
end
#+END_SRC

That ~row_next_y_value~ is wired to all of the row solvers, but the
start grant signal (a one-hot signal) means that at most a single row solver
will latch that ~row_next_y_value~ on any cycle. That grant signal is
given to the row solver with smallest index AND whose start request signal is
high. The signal is generated by the ~Reqs_To_One_Hot~ module.

That same ~Reqs_To_One_Hot~ module is instantiated a second time to
arbitrate which row solver gets to return a value in a given cycle. The
arbiter's input is a wire with each bit set by the inverse of a FIFO's
~empty~ signal; that is, when a FIFO is not empty it is making a request
to the arbiter. When the arbiter gives that FIFO a grant the FIFO's output is
muxed to the frame solver's outputs and the FIFO receives a ~rdreq~
signaling that it should advance its output.

The generator for loop instantiates the row solvers and FIFOs. The size of all
the connections and the loop are all parameterized by
~NUM_ROWS_SOLVERS~.


