Reports/Website/JuliaProcessor.html

<div id="outline-container-org6bc49f6" class="outline-4">
<h4 id="org6bc49f6"><span class="section-number-4">3.1.3</span> Assembler</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">encodeLoad</span> <span style="color: #ff6347;">::</span> <span style="color: #8ae234; font-weight: bold;">Maybe</span> <span style="color: #8ae234; font-weight: bold;">IR.Instruction</span> <span style="color: #ff6347;">-&gt;</span> <span style="color: #8ae234; font-weight: bold;">BV.BV</span>
<span style="color: #edd400; font-weight: bold;">assemble</span> <span style="color: #ff6347;">::</span> <span style="color: #8c8c8c;">[</span><span style="color: #8ae234; font-weight: bold;">IR.Cycle</span><span style="color: #8c8c8c;">]</span> <span style="color: #ff6347;">-&gt;</span> <span style="color: #8c8c8c;">[</span><span style="color: #8ae234; font-weight: bold;">Word128</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>

<p>
Reversed and assembled:
</p>
<pre class="example">
[
  1073742606,
  1074792207,
  8534579836514498005434368,
  2924556919630725120,
  1073743632,
  1074791185,
  4075231024617881600,
  1329228005872192911768272894028677120,
  1329228015785384632608232126619320320,
  3485829014013083648,
  3488083014997508096,
  0,
  1329227995823601499131475193870942208,
  2316000299778572288,
  2315998098607833088,
  0,
  1074791429,
  1073741828,
  2314861207879680000,
  0,
  0
]
</pre>
</div>
</div>
</div>

<div id="outline-container-org1244ae1" class="outline-3">
<h3 id="org1244ae1"><span class="section-number-3">3.2</span> VLIW Processor</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The VLIW processor, as indicated in <a href="#org64fbe3c">Compiler</a>, has Load, Neg, Add,
and Mul pipes. It additionally has a register file and all the logic required to marshal data to and from registers/pipes as needed.
</p>

<p>
The processor has a floating point register file where the first three registers
(indexes 0-2) are special-purpose and the remainder are general
purpose. Registers 0 and 1 are designated to hold the real and imaginary
components of \(Z\) respectively. Thus, the compiled program can count on the
result of the previous iteration being there and is responsible for storing the
result of its computation there as well. In the next section I describe how
\(Z_0\) is loaded into those registers. Register 2 is special-purposed to throw an
interrupt when a value larger than <code>max_magnitude</code> is written to it. The last
thing the compiled programs do is calculate the squared magnitude of \(Z_n\) and
write it to register 2; if the magnitude has escaped the threshold then the
processor sets its <code>done</code> flag high (the VLIW processor takes no further action,
but the Row Solver's response is described next).
</p>
</div>
</div>

<div id="outline-container-org0077a5b" class="outline-3">
<h3 id="org0077a5b"><span class="section-number-3">3.3</span> Row Solver</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The Row Solver has two (TODO) states: a <code>reset/init</code> state and <code>compute</code> state. An
interesting note is that the pixel solver is restarted within the same cycle as
it finishes if the row solver hasn't reached the end of the row yet, saving
hundreds of cycles per row. Otherwise, this is a pretty trivial implementation.
</p>

<p>
Note that the signals that start with <code>solver_</code> reference the pixel
solver's signals, not the row solver's. 
</p>

<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #8ae234; font-weight: bold;">parameter</span> state_reset=0, state_compute=1;
<span style="color: #729fcf; font-weight: bold;">always</span> <span style="color: #8ae234; font-weight: bold;">@</span><span style="color: #8c8c8c;">(</span><span style="color: #729fcf; font-weight: bold;">posedge</span> solver_clk<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
   <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #8c8c8c;">(</span>reset || state == state_reset<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
      state &lt;= state_reset;
      start_request &lt;= 1;
      <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>start_grant<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
         state &lt;= state_compute;
         start_request &lt;= 0;
         output_row_idx &lt;= row_y_idx;
         <span style="color: #888a85;">// </span><span style="color: #888a85;">start the simulation of the first element of the row</span>
         solver_C_A_reference &lt;= row_x_reference;
         solver_C_A_step      &lt;= row_x_step;
         column_idx           &lt;= 0;
         solver_C_B           &lt;= row_y;
         solver_start         &lt;= 1;
      <span style="color: #8ae234; font-weight: bold;">end</span>
   <span style="color: #8ae234; font-weight: bold;">end</span>
   <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>state == state_compute<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
      <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>solver_start<span style="color: #8c8c8c;">)</span> solver_start &lt;= 0; <span style="color: #888a85;">// </span><span style="color: #888a85;">only needs to be hi once</span>
      <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>solver_done<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
         <span style="color: #888a85;">// </span><span style="color: #888a85;">receive results</span>
         <span style="color: #888a85;">// </span><span style="color: #888a85;">start on new results</span>
         <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>column_idx == 639<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span> <span style="color: #888a85;">// </span><span style="color: #888a85;">just finished last column</span>
            state &lt;= state_reset;
         <span style="color: #8ae234; font-weight: bold;">end</span>
         <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
            column_idx   &lt;= column_idx + 1;
            solver_start &lt;= 1;
         <span style="color: #8ae234; font-weight: bold;">end</span>
      <span style="color: #8ae234; font-weight: bold;">end</span>
   <span style="color: #8ae234; font-weight: bold;">end</span>
<span style="color: #8ae234; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org75721c1" class="outline-3">
<h3 id="org75721c1"><span class="section-number-3">3.4</span> Frame Solver</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The frame solver consists of two main components: the arbiters getting data
to/from the row sovlers and a generate loop which instantiates the row
solvers/their FIFOs.
</p>

<p>
A minimal state machine generates a new imaginary number corresponding to a row
that needs to be computed every time a row solver receives a grant:
</p>

<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #729fcf; font-weight: bold;">always</span> <span style="color: #8ae234; font-weight: bold;">@</span><span style="color: #8c8c8c;">(</span><span style="color: #729fcf; font-weight: bold;">posedge</span> solver_clk<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
   frame_done_stb &lt;= 0; <span style="color: #888a85;">// </span><span style="color: #888a85;">default value</span>
   <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>reset<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
      row_next_y_idx &lt;= 0;
      row_next_y_value &lt;= y_0;
   <span style="color: #8ae234; font-weight: bold;">end</span>
   <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>row_next_y_idx == 479<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
      <span style="color: #888a85;">// </span><span style="color: #888a85;">frame is done</span>
      row_next_y_idx &lt;= 0;
      frame_done_stb &lt;= 1;
      <span style="color: #888a85;">// </span><span style="color: #888a85;">reset things</span>
      row_next_y_idx &lt;= 0;
      row_next_y_value &lt;= y_0;
   <span style="color: #8ae234; font-weight: bold;">end</span>
   <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #8c8c8c;">(</span>row_solver_start_grant &gt; 0<span style="color: #8c8c8c;">)</span> <span style="color: #8ae234; font-weight: bold;">begin</span>
      row_next_y_idx &lt;= row_next_y_idx + 1;
      row_next_y_value &lt;= row_next_y_value_adder_out;
   <span style="color: #8ae234; font-weight: bold;">end</span>
<span style="color: #8ae234; font-weight: bold;">end</span>
</pre>
</div>

<p>
That <code>row_next_y_value</code> is wired to all of the row solvers, but the
start grant signal (a one-hot signal) means that at most a single row solver
will latch that <code>row_next_y_value</code> on any cycle. That grant signal is
given to the row solver with smallest index AND whose start request signal is
high. The signal is generated by the <code>Reqs_To_One_Hot</code> module.
</p>

<p>
That same <code>Reqs_To_One_Hot</code> module is instantiated a second time to
arbitrate which row solver gets to return a value in a given cycle. The
arbiter's input is a wire with each bit set by the inverse of a FIFO's
<code>empty</code> signal; that is, when a FIFO is not empty it is making a request
to the arbiter. When the arbiter gives that FIFO a grant the FIFO's output is
muxed to the frame solver's outputs and the FIFO receives a <code>rdreq</code>
signaling that it should advance its output.
</p>

<p>
The generator for loop instantiates the row solvers and FIFOs. The size of all
the connections and the loop are all parameterized by
<code>NUM_ROWS_SOLVERS</code>.
</p>
</div>
</div>
</div>
