Reports/Website/JuliaProcessor.org
* Results of the design:

    # Any and all test data, scope traces, waveforms, etc
    # speed of execution (hesitation, filcker, interactiveness, concurrency)
    # accuracy (numeric, music frequencies, video signal timing, etc)
    # how you enforced safety in the design.
    # interference with other people's designs (e.g. cpu noise, RF interference)
    # usability by you and other people

* Conclusions:

    # Analyse your design in terms of how the results met your expectations. What might you do differently next time?
    # How did your design conform to the applicable standards?
    # Intellectual property considerations.
    #     Did you reuse code or someone else's design? Did you use any of Altera's IP?
    #     Did you use code in the public domain?
    #     Are you reverse-engineering a design? How did you deal with patent/trademark issues?
    #     Did you have to sign non-disclosure to get a sample part?
    #     Are there patent opportunites for your project?
    # Legal considerations. For instance, if you use a transmitter, you must discuss the appropriate FCC legal restrictions.


* Appndix A
- The group approves this report for inclusion on the course website.
- The group approves the video for inclusion on the course youtube channel.

* Appendix with commented Verilog and/or program listings. When posting code, you must comply with all Altera IP considerations.
* Appendix with schematics if you build hardware external to the DE2 board (you can download free software from expresspcb.com to draw schematics).
* Appendix with a list of the specific tasks in the project carried out by each team member.
* References you used:
    # Data sheets
    # Vendor sites
    # Code/designs borrowed from others
    # Background sites/paper

