Reports/Website/JuliaProcessor.html


<div id="outline-container-orgf298705" class="outline-2">
<h2 id="orgf298705"><span class="section-number-2">4</span> Results of the design:</h2>
</div>

<div id="outline-container-orgd9bfdf4" class="outline-2">
<h2 id="orgd9bfdf4"><span class="section-number-2">5</span> Conclusions:</h2>
</div>

<div id="outline-container-orgbfece45" class="outline-2">
<h2 id="orgbfece45"><span class="section-number-2">6</span> Appndix A</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>The group approves this report for inclusion on the course website.</li>
<li>The group approves the video for inclusion on the course youtube channel.</li>
</ul>
</div>
</div>

<div id="outline-container-org90b7906" class="outline-2">
<h2 id="org90b7906"><span class="section-number-2">7</span> Appendix with commented Verilog and/or program listings. When posting code, you must comply with all Altera IP considerations.</h2>
</div>
<div id="outline-container-org1fcd7f1" class="outline-2">
<h2 id="org1fcd7f1"><span class="section-number-2">8</span> Appendix with schematics if you build hardware external to the DE2 board (you can download free software from expresspcb.com to draw schematics).</h2>
</div>
<div id="outline-container-org19429b8" class="outline-2">
<h2 id="org19429b8"><span class="section-number-2">9</span> Appendix with a list of the specific tasks in the project carried out by each team member.</h2>
</div>
<div id="outline-container-orgfb12364" class="outline-2">
<h2 id="orgfb12364"><span class="section-number-2">10</span> References you used:</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Istvan P. Burbank</p>
<p class="date">Created: 2017-05-16 Tue 05:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
